from cumulate import cumulator

Gaussion_dict = {
    0: [[0, 2]],
    1: [[0.5773503, 1],
        [-0.5773503, 1]],
    2: [[0.77459667, 0.5555556],
        [-0.77459667, 0.5555556],
        [0, 0.8888889],
        ],
    3: [[0.8611363, 0.3478548],
        [-0.8611363, 0.3478548],
        [0.3399810, 0.6521452],
        [-0.3399810, 0.6521452],
        ],
    4: [[0.9061798, 0.2369269],
        [-0.9061798, 0.2369269],
        [0.5384693, 0.4786287],
        [-0.5384693, 0.4786287],
        [0, 0.5688889],
        ]
}

class Gaussion_cumulate(cumulator):

    def cal(self,n):
        # 本题仅仅是0~1的区间，所以根据偶函数，可以求-1~1区间的积分除二
        ans = 0
        for point in Gaussion_dict[n]:
            ans += self.f(point[0])*point[1]
        return ans/2
